Angular.ng-template
bierner.markdown-emoji
dbaeumer.vscode-eslint
eamodio.gitlens
esbenp.prettier-vscode
espressif.esp-idf-extension
formulahendry.auto-rename-tag
formulahendry.code-runner
hediet.debug-visualizer
jeff-hykin.better-cpp-syntax
johnpapa.angular-essentials
johnpapa.Angular2
johnpapa.vscode-peacock
johnpapa.winteriscoming
kisstkondoros.vscode-gutter-preview
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
naumovs.color-highlight
PKief.material-icon-theme
ritwickdey.LiveServer
rust-lang.rust-analyzer
tomoki1207.pdf
twxs.cmake
vadimcn.vscode-lldb
vscodevim.vim
